#+TITLE: Wemos QA keypad

* Device install

To setup a new device you can use the arduino software, you will need a plugin to upload the files in the =data= folder to your wemos device.

https://github.com/esp8266/arduino-esp8266fs-plugin/releases/tag/0.4.0


* Device Setup

When switching on the device for the first time it will launch in access point mode to allow you to setup the device, connect to =weeeecfg= from a phone and enter password =weeeecfg= to setup the device. If the device can not connect to a local network it will relaunch the setup interface.

subsequent usage of the device will reuse the same settings as long as the device can connect.

The interfacing is using a simple web interface generated from this repository.

https://gitlab.com/olymk2/weecfg


* API example
  
** Keypad startup endpoint
#+BEGIN_SRC http
POST http://ng.snapwire-portal.co.uk/api/Startup
Content-Type: application/json

{"ControllerId": "DID1"}
#+END_SRC

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Cache-Control: no-cache
Pragma: no-cache
Content-Type: application/json; charset=utf-8
Expires: -1
Server: Microsoft-IIS/8.5
X-AspNet-Version: 4.0.30319
X-Powered-By: ASP.NET
Date: Mon, 07 Oct 2019 18:50:37 GMT
Content-Length: 44

{"ControllerId":"DID1","AssignedName":"Bob"}
#+end_example

** Poll to determine when ready for next answer
#+BEGIN_SRC http
POST http://ng.snapwire-portal.co.uk/api/Poll
Content-Type: application/json

{}
#+END_SRC

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Cache-Control: no-cache
Pragma: no-cache
Content-Type: application/json; charset=utf-8
Expires: -1
Server: Microsoft-IIS/8.5
X-AspNet-Version: 4.0.30319
X-Powered-By: ASP.NET
Date: Mon, 07 Oct 2019 17:05:12 GMT
Content-Length: 60

{"Timestamp":132149415123628674,"ReadyToAcceptAnswers":true}
#+end_example

** Example sending answer to api.
#+BEGIN_SRC http
POST http://ng.snapwire-portal.co.uk/api/SubmitAnswer
Content-Type: application/json

{"ControllerId": "sample string 1", "Answer": "#"}
#+END_SRC

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Cache-Control: no-cache
Pragma: no-cache
Content-Type: application/json; charset=utf-8
Expires: -1
Server: Microsoft-IIS/8.5
X-AspNet-Version: 4.0.30319
X-Powered-By: ASP.NET
Date: Mon, 07 Oct 2019 17:04:35 GMT
Content-Length: 24

{"ConfirmReceived":true}
#+end_example

http://ng.snapwire-portal.co.uk/api/SubmitAnswer

* Later
** TODO gzip the html

The wemos is by no means fast so gzip so there is less data to send.
